---
title: 深度探索c++对象模型
descriptions: 总结c++对象模型
categories: language
tags: implement
---

## why 

为什么要学习或者总结这本书？

1. 了解c++对象模型底层实现
2. 了解在语言之下，编译器做了什么事情 
3. 希望可以写出没有错误倾向而且比较有效率的C++代码
4. 消除各种对c++的错误认识

## what

包含哪些内容？

1. 关于对象，提供以对象为基础的观念背景以及c++提供的面向对象程序设计范式
2. 构造函数语意学，讨论constructor 如何工作
3. Data 语意学，讨论data members的处理
4. Function 语意学，讨论各种member function，特别是virtual function
5. 构造、析构、拷贝语意学，讨论如何支持class模型和Object生命周期
6. 执行期语意学，讨论执行期的某些对象模型行为，包括临时性对象生命周期，new，delete支持
7. 对象模型的尖端：exception handling, template support, runtime type identification

## how

如何推进学习进度？计划是什么？如何实践书中理论知识？如何加强理解？

1. 分章节学习，总结，计划是一天一章
2. 对于书中的知识，如果需要验证的，可以写些demo验证
3. 多思考c++对象模型为什么要这样设计或实现，有其他的实现方案吗？如果有想法可以记录下来

## 一、关于对象

### c++对象模式

1. 加上封装后的布局成本：

   c++ obj并没有增加成本，nonstatic data members直接内含在每一个obj中，就像c struct一样。而member function虽然在class内声明，却不出现在object中。每一个non-inline member func只会诞生一个函数实例。而每一个”拥有零个或一个定义“的inline function则会在其每一个使用者（模块）上产生一个函数实例

2. c++ 在布局和存取时间上的主要额外负担是由virtual引起的

   1. virtual function 执行期绑定
   2. virtual base class
   3. 多重继承：一个derived class和他的第二或后继base class的转换

3. c++ 对象模式，解决如何存储对象成员的问题

   2种class data member： static， non-static

   3种class member functions： static， non-static， virtual

   1. 简单对象模型

      object 内部是一系列的slots，每一个slot指向一个members，按其声明顺序填充member指针。

      对于继承：包含base class object的地址，或者有一个base table和bptr。

      缺点：间接性导致的空间和存取时间上的额外负担

   2. 表格驱动对象模型


根据上面的布局图，当派生对象指针指向赋值给他的第二或后继base class指针时，编译器内部需要做转化：

 ```c++
Vertex3d v3d, *pv3d;
Vertex *pv;

pv = &v3d;
// 需要转化为
pv = (Vertex*)((char*)&v3d) + sizeof(Point3d);

pv = pv3d;
// 需要转换为
pv = pv3d ? (Vertex*)((char*)pv3d) + sizeof(Point3d) : 0;
 ```

存取第二或后继base class中的meber，并不会带来额外负担，因为member的位置在编译期就固定了，存取member只是一个简单的offset操作，就像单一继承一样简单---不管是经由指针、reference 还是object。

#### 虚拟继承

虚拟继承是为了解决类似菱形继承中的virtual base class subobject的共享问题。如果class含有virutal base class, 那么他的object内存被分为两部分：**不变区域**和**可变区域**。不变区域中的数据，不管后继如何演化，总是拥有固定的offset（从object的开头算起），这部分数据可以被直接存取。而共享区域就是指virtual base class，这部分的数据，其位置会因为每次的派生操作而有变化，所以他们只可以被间接存取。接下来，还是通过打印内存布局来验证（MacOS clang 12.0）：

```c++
// layout.cc
class Point2d {
 public:
  Point2d(int x = 0, int y = 0) : _x(x), _y(y) {}
  virtual int z() const { return 0; }

 public:
  int _x, _y;
};

class Vertex : public virtual Point2d {
 public:
  Vertex(int v = 0) : _v(v) {}
  Vertex(int x, int y, int v) : Point2d(x, y), _v(v) {}
  virtual void print() {}

 public:
  int _v;
};

class Point3d : public virtual Point2d {
 public:
  Point3d(int x = 0, int y = 0, int z = 0) : Point2d(x, y), _z(z) {}
  int z() { return _z; }

 public:
  int _z;
};

class Vertex3d : public Point3d, public Vertex {
 public:
  Vertex3d(int m = 0) : _m(m) {}
  Vertex3d(int x, int y, int z, int v, int m)
      : Point3d(x, y, z), Vertex(x, y, v), Point2d(x, y), _m(m) {}

 public:
  int _m;
};

int main() { return sizeof(Vertex3d); }
```

使用自己实现的print_layout_with_single_vptr_start打印内存布局：

```shell
------- type 7Point2d layout --------
sizeof(7Point2d) = 16, sizeof(ut) = 16
[0  ~  7] 7Point2d vptr: 0x101ad1190 # vptr
[08 ~ 11] int[0]: 00000001
[12 ~ 15] int[1]: 00000002

-------- type 7Point3d layout --------
sizeof(7Point3d) = 32, sizeof(ut) = 32
[0  ~  7] 7Point3d vptr: 0x101ad11c0 # vptr
[08 ~ 11] int[0]: 00000003
[12 ~ 15] int[1]: 00007ffe  # alignment
[16 ~ 19] int[2]: 01ad11d8  # vptr 0x101ad11d8
[20 ~ 23] int[3]: 00000001
[24 ~ 27] int[4]: 00000001
[28 ~ 31] int[5]: 00000002

-------- type 6Vertex layout --------
sizeof(6Vertex) = 32, sizeof(ut) = 32
[0  ~  7] 6Vertex vptr: 0x101ad1230
[08 ~ 11] int[0]: 00000004
[12 ~ 15] int[1]: 00007ffe # alignment
[16 ~ 19] int[2]: 01ad1250 # vptr 0x101ad1250
[20 ~ 23] int[3]: 00000001
[24 ~ 27] int[4]: 00000001
[28 ~ 31] int[5]: 00000002

-------- type 8Vertex3d layout --------
sizeof(8Vertex3d) = 48, sizeof(ut) = 48
[0  ~  7] 8Vertex3d vptr: 0x101ad12a8 # vptr
[08 ~ 11] int[0]: 00000003
[12 ~ 15] int[1]: 00000006 # alignment
[16 ~ 19] int[2]: 01ad12c0 # vertex vptr 0x101ad12c0
[20 ~ 23] int[3]: 00000001
[24 ~ 27] int[4]: 00000004 # _v
[28 ~ 31] int[5]: 00000005 # _m
[32 ~ 35] int[6]: 01ad12e0 # p2d vptr 0x101ad12e0
[36 ~ 39] int[7]: 00000001
[40 ~ 43] int[8]: 00000001
[44 ~ 47] int[9]: 00000002
```

使用clang 打印内存布局如下，与上面结果一致：

```shell
clang -cc1 -fdump-record-layouts layout.cc

*** Dumping AST Record Layout
         0 | class Point2d
         0 |   (Point2d vtable pointer)
         8 |   int _x
        12 |   int _y
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Point3d
         0 |   (Point3d vtable pointer)
         8 |   int _z
        16 |   class Point2d (virtual base)
        16 |     (Point2d vtable pointer)
        24 |     int _x
        28 |     int _y
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vertex
         0 |   (Vertex vtable pointer)
         8 |   int _v
        16 |   class Point2d (virtual base)
        16 |     (Point2d vtable pointer)
        24 |     int _x
        28 |     int _y
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class Vertex3d
         0 |   class Point3d (primary base)
         0 |     (Point3d vtable pointer)
         8 |     int _z
        16 |   class Vertex (base)
        16 |     (Vertex vtable pointer)
        24 |     int _v
        28 |   int _m
        32 |   class Point2d (virtual base)
        32 |     (Point2d vtable pointer)
        40 |     int _x
        44 |     int _y
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=32, nvalign=8]
```

使用 g++ 打印内存布局（结果有点难看懂，但给出了virtual table的详细信息）：

```shell
g++ -fdump-lang-class -c layout.cc

Vtable for Point2d
Point2d::_ZTV7Point2d: 3 entries
0     (int (*)(...))0
8     (int (*)(...))(& _ZTI7Point2d)
16    (int (*)(...))Point2d::z

Class Point2d
   size=16 align=8
   base size=16 base align=8
Point2d (0x0x7f6d75ceb420) 0
    vptr=((& Point2d::_ZTV7Point2d) + 16)

Vtable for Vertex
Vertex::_ZTV6Vertex: 8 entries
0     16                           # 共享vbc object偏移，虚拟继承才有
8     (int (*)(...))0              # 本subobject的偏移
16    (int (*)(...))(& _ZTI6Vertex)
24    (int (*)(...))Vertex::print
32    0                             # 0 表示共享对象的偏移
40    (int (*)(...))-16             # Point2d 在 vertex object 中的偏移 为16
48    (int (*)(...))(& _ZTI6Vertex) # type info
56    (int (*)(...))Point2d::z

VTT for Vertex
Vertex::_ZTT6Vertex: 2 entries
0     ((& Vertex::_ZTV6Vertex) + 24)
8     ((& Vertex::_ZTV6Vertex) + 56)

